---
title: RebarShapeSegment
classe: Autodesk.Revit.DB.Structure.RebarShapeSegment
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# RebarShapeSegment

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `rebarShapeSegment.IsValidObject` | Boolean |
| `Void Dispose()` | `rebarShapeSegment.Dispose()` | Void |
| `IList<RebarShapeConstraint> GetConstraints()` | `rebarShapeSegment.GetConstraints()` | IList<RebarShapeConstraint> |
| `Void SetConstraints(IList<RebarShapeConstraint>)` | `rebarShapeSegment.SetConstraints(constraints)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```